# -*- coding: utf-8 -*-
# Code By Rishat Sultanov
# БД с учетками :D
# Админка хилая :)
#
# Описание "программы"
# ==============================================================================================================================================
# Имеется словарь в словаре. Первый словарь называю глобальным ( Он имеет следующие ключи user1,user2,user3) Вторые словари называю вторичным словарем. 
# ( Они идут как значение глобального словаря и у них есть свои ключи и значения. Где ключ это структура учеток, а значение это данные в структуре.
# Пример стуктуры и значения в ней "Age" - структура "None" значение в ней. )
# ==============================================================================================================================================
#
# Что нужно реализовать: 
# ==============================================================================================================================================
# Реализовать возможность пользователю изменять название ключей в глобальном и вторичном словаре.( Отсутствие потерь значений и других ключей. ) 
#                                                               (: ПРОСИЛ НА ПАРЕ :)
# ==============================================================================================================================================
import copy # Для резервации базы 
baza = {"user1": {"Name": None,"Fname": None, "Zarplata": None,"Age": None},"user2": {"Name": None,"Fname": None, "Zarplata": None,"Age": None},"user3": {"Name": None,"Fname": None, "Zarplata": None,"Age": None}}
while True: # Цикл админки.
    print u"""
    ██████████████████████████████████████
    █────██───██─███─█─██─█─██─█─██─█────█
    █─██─██─█─██──█──█─██─█─██─█─█─██─██─█
    █────██─█─██─█─█─█─█──█────█──███────█
    █─██─█─────█─███─█──█─█─██─█─█─██─██─█
    █─██─█─███─█─███─█─██─█─██─█─██─█─██─█
    ██████████████████████████████████████
    """
    print u"Вы попали в административный раздел БД"
    print u"Меню"
    print "-----------------"
    print u"1) Изменить данные в учетках(+)"
    print u"2) Заглянуть в базу(+)"
    print u"3) Заглянуть в структуру учеток(+)"
    print u"4) Заглянуть в базу учеток(+)"
    print u"5) Удалить все данные в базе.(+)"
    print u"6) Выполнить резервацию БД.(+)"
    print u"7) Востановить данные в БД.(+)"
    print u"8) Удалить резервную БД.(+)"
    print u"9) Заглянуть в резервную БД.(+)"
    print u"10)Изменить данные в учетках (+)"
    print u"11)Редактировать базу(НУЖНО РЕАЛИЗОВАТЬ)" # ПРОСИЛ НА ПАРЕ :) 
    print u"N) Удалить учетку из БД(РАЗРАБОТКА)"
    otvet = int(raw_input("> ")) # Пользователь (Его выбор из меню админки)
    if otvet == 1: # Выводим ключи и словари ( учетки и структуру данных в них)
        virtualbd = baza.keys() # Запрашиваем главные ключи ( Название учеток )
        print " "
        print " "
        print "###################"
        print u"Ваш список логинов"
        print virtualbd
        print "###################"
        print " "
        print " "
        for login, infa in baza.items(): # Прогоняем по словарю глобальному и выводим его значение
            print " "
            print " "
            print "###################"
            print u"Аккаунт имеет структуру: ", baza[login]
            print "###################"
            print " "
            print " "
            for login2, infa2 in infa.items():# Прогоняем по словарю вторичному и выводим его значение
                print " "
                print " "
                print u"-----РАЗДЕЛ-----"
                print login2
                print "----------------"
                print " "
                print " "
                print u"-----Данные в разделе-----"
                print infa2
                print "--------------------------"
                print " "
                print " "
                print u"Езмените данные в разделе"
                infa[login2] = raw_input("> ")
                print " "
                print " "
                print u"*****Успешно данные внесены*****"
    elif otvet == 2: # Выводим глобальный словарь ( БД )
        print " "
        print " "
        print u"Ваша база приведена ниже!"
        print baza
        print " "
        print " "
    elif otvet == 3: # Выводим вторичной словарь и его значение
        for loginrKey, loginrInfa in baza.items():
            print " "
            print loginrKey, loginrInfa
            print "================================================================"
            for key, infaInInfa in loginrInfa.items():
                print key, infaInInfa
                print "************************************************************"
    elif otvet == 4: # Выводим ключи глобального словаря ( Имена учеток  )
        print " "
        print " "
        print "####ЛОГИНЫ####"
        print baza.keys()
        print "##############"
        print " "
        print " "
    elif otvet == 5: # Чистим глобальный словарь ( Учетки и данные в них)
        print " "
        print " "
        baza.clear()
        print u"####УСПЕШНОЕ####"
        print u"####УДАЛЕНИЕ####"
        print " "
        print " "
    elif otvet == 6: # Глобальный словарь закидываем в другую переменную ( БД закидываем в резервную БД)
        print " "
        print " "
        bazarezerv = copy.deepcopy(baza)
        print u"####РЕЗЕРВАЦИЯ####"
        print u"####УСПЕШНО#######"
        print bazarezerv
        print " "
        print " "
    elif otvet == 7: # Резервный словарь закидывается в глобальный словарь ( БД резерватор залетает в БД глобальную)
        print " "
        print " "
        print bazarezerv
        baza = bazarezerv.copy()
        print u"####ВОСТАНОВЛЕНИЕ####"
        print u"####УСПЕШНО##########"
        print " "
        print " "
    elif otvet == 8: # Резервный словарь принимает значение None - {} (Удаляем данные с резервной БД)
        print " "
        print " "
        bazarezerv.clear()
        print u"####УСПЕШНОЕ####"
        print u"####УДАЛЕНИЕ РЕЗЕРВА####"
        print " "
        print " "
    elif otvet == 9: # Выводим резервный словарь ( Выводим резервную БД на экран)
        print " "
        print " "
        print u"####РЕЗЕРВ ПРИВЕДЕН НИЖЕ####"
        print bazarezerv
        print " "
        print " "
    elif otvet == 10: # Меняем значение структуры вторичного словаря ( Меняем структуру и значение в ней)
        print " "
        print " "
        print u"####Вводите название данных для значения логина####"
        for newlogin in baza.keys():
            print u"Хотите вы отредактировать данный логин?(1)Yes (2) Next (3)No"
            print newlogin
            otvet = int(raw_input("> "))
            if otvet == 1:
                print u'Вы редактиуете приведенный ниже логин'
                print u"Редактировать строко путем создания словаря!"
                print newlogin
                baza[newlogin] = dict(input(">  "))
            elif otvet == 2:
                continue
            else:
                break
        print baza
        print " "
        print " "
    elif otvet == 11: # Нужно реализовать
        print " "
        print " "
        # Сюда пишем кодик реализации :)
        print " "
        print " "
    else:
        print " "
        print " "
        print u"Вводите точнее"
        print " "
        print " "
